questionsCommentaires.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-28 Mon 04:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Question/Commentaire ift6172</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Question/Commentaire ift6172</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb115011">1. fortifying macros, Jean-Alexandre Barszcz</a>
<ul>
<li><a href="#orgdcafb30">1.1. abstract</a></li>
<li><a href="#org9e84e00">1.2. questions</a>
<ul>
<li><a href="#org719432b">1.2.1. Questions:</a></li>
<li><a href="#org9191e5a">1.2.2. commentaires:</a></li>
</ul>
</li>
<li><a href="#orgbd8c494">1.3. conclusion</a></li>
<li><a href="#org12ee741">1.4. links and other articles</a></li>
<li><a href="#orgb82f0c5">1.5. keywords</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgb115011" class="outline-2">
<h2 id="orgb115011"><span class="section-number-2">1</span> fortifying macros, Jean-Alexandre Barszcz</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdcafb30" class="outline-3">
<h3 id="orgdcafb30"><span class="section-number-3">1.1</span> abstract</h3>
<div class="outline-text-3" id="text-1-1">
<blockquote>
<p>
Existing macro systems force programmers to make a choice between clarity of
specification and robustness. If they choose clarity, they must forgo validating
significant parts of the specification and thus produce low-quality language
extensions. If they choose robustness, they must write in a style that mingles
the implementation with the specification and therefore obscures the latter.
This paper introduces a new language for writing macros. With the new macro
system, programmers naturally write robust language extensions using easy-to-
understand specifications. The system translates these specications into
validators that detect misuses—including violations of context-sensitive
constraints—and automatically synthesize appropriate feedback, eliminating the
need for ad hoc validation code.
</p>
</blockquote>
<p>
<a class='org-ref-reference' href="#Culpepper_2010">Culpepper_2010</a>
</p>
</div>
</div>

<div id="outline-container-org9e84e00" class="outline-3">
<h3 id="org9e84e00"><span class="section-number-3">1.2</span> questions</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org719432b" class="outline-4">
<h4 id="org719432b"><span class="section-number-4">1.2.1</span> Questions:</h4>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li><p>
<b>only</b>? as opposed to what
</p>
<blockquote>
<p>
macros only extend the definition and expression forms of the language, and a macro name must occur in operator position or alone, like a variable reference—extensions to the language easily compose.
</p>
</blockquote></li>

<li><p>
where does that statement come from? :
</p>
<blockquote>
<p>
Existing macro systems force programmers to make a choice between clarity of specification and robustness. If they choose clarity, they must forgo validating significant parts of the specification and thus produce low-quality language extensions. If they choose robustness, they must write in a style that mingles the implementation with the specification and therefore obscures the latter.
</p>
</blockquote></li>

<li>separating parsing from code generation: what does that mean concretely,</li>
</ol>
<p>
the pattern matching construct?
</p>
</div>
</div>

<div id="outline-container-org9191e5a" class="outline-4">
<h4 id="org9191e5a"><span class="section-number-4">1.2.2</span> commentaires:</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>This is rather vague, where is <code>validation</code> defined</li>
</ul>
<blockquote>
<p>
Without validation, however, macros are not true abstractions. Instead, erroneous terms flow through the parsing process until they eventually trip over constraint checks at the lower levels of the language tower. Low-level checking, in turn, yields incoherent error messages referring to terms the programmer did not write and concepts that do not apply to the programmer’s code. In short, such macros are sources of confusion and distraction, not seamless linguistic abstractions
</p>
</blockquote>

<ul class="org-ul">
<li><p>
MBE:
</p>
<blockquote>
<p>
The crucial innovation of MBE is the use of ellipses (. . . ) to describe
sequences of sub-terms with homogeneous structure—ellipses can be
considered as an S- expression version of the familiar “Kleene star”
operator. Homogeneous sequences occur frequently in S-expression syntax.
Often the elements of sequences have non- trivial structure, such as the
binding pairs associating let-bound variables with their values in the code
above.
</p>
</blockquote>
<p>
Really?, arent those just variadics for macros?
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbd8c494" class="outline-3">
<h3 id="orgbd8c494"><span class="section-number-3">1.3</span> conclusion</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Really interesting arcticle which I didn&rsquo;t far enough into but it seems
to lack an overarching theoretical inquiry and to be more focused on how
to implement new lexical constructs. The fact that pattern matching is so
foundational to the macro system calls for more definitions:
</p>
<ul class="org-ul">
<li>what is pattern matching, what are its limits, etc</li>
</ul>
</div>
</div>



<div id="outline-container-org12ee741" class="outline-3">
<h3 id="org12ee741"><span class="section-number-3">1.4</span> links and other articles</h3>
<div class="outline-text-3" id="text-1-4">
<p>
MBE: sperber et al 2009 syntax rules
</p>

<ul class="org-ul">
<li>Kollbecker : macros by example
<ul class="org-ul">
<li> <a href="./_20191028_031015popl-87.pdf">kollbecker-mbe</a></li>
</ul></li>

<li>cl vs racket macros: <a href="https://eli.thegreenplace.net/2007/09/16/common-lisp-vs-scheme-macros/">Common Lisp vs. Scheme macros - Eli Bendersky&rsquo;s website</a></li>

<li><a href="https://www.youtube.com/watch?v=KpDyuMIb_E0&amp;index=25&amp;list=PLZdCLR02grLp4W4ySd1sHPOsK83gvqBQp">Synthesis and Verification for All - Emina Torlak - YouTube</a></li>

<li> <a href="./_20191028_040824tactic.pdf">_20191028<sub>040824tactic.pdf</sub></a></li>

<li>understanding software through linguistic abstraction
<ul class="org-ul">
<li> <a href="./_20191028_0318011-s2.0-S0167642313003365-main.pdf">understanding software through linguistic abstraction</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb82f0c5" class="outline-3">
<h3 id="orgb82f0c5"><span class="section-number-3">1.5</span> keywords</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>fender</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-10-28 Mon 04:44</p>
</div>
</body>
</html>
